In [1]:
import numpy as np
import pandas as pd
# Pandas is an open source data analysis library written in python
# It leverages the power and speed of numpy to make data analysis and preprocessing easy for data scientists
# It provides rich and highly robust data operations

In [2]:
# Pandas has two types of data structures:
# a) Series — It's a one dimensional array with indexes, it stores a single column or row of data in a Dataframe
# b) Dataframe — It's a tabular spreadsheet like structure representing rows each of which contains one or multiple columns
# A one-dimensional array(labeled) capable of holding any type of data— Series
# A two-dimensional data (labeled) structure with columns of potentially different types of data - DataFrame

In [3]:
dict1 = {
    "name": ['harry', 'rohan', 'skillf', 'shubh'],
    "marks": [92, 34, 24, 17],
    "city": ['rampur', 'kolkata', 'bareilly', 'antartica']
}

In [4]:
df = pd.DataFrame(dict1) 
# we will store data frame in a variable
# data frame is like a excel sheet. with data frame help we can do fast indexing, we can also able to use numpy function

In [5]:
df

     name  marks       city
0   harry     92     rampur
1   rohan     34    kolkata
2  skillf     24   bareilly
3   shubh     17  antartica

In [6]:
df.to_csv('friends.csv')   
# convert data frame into csv file
# syntax : df.to_csv ('filename.csv')

In [7]:
# if we don't want index in our csv file then
df.to_csv('friends_index_false.csv' , index = False)
# false first word should be in capital letter
# NOTE: index means row, aur column ko column hi bolte hain

In [8]:
df.head (2)
# ye suru ka 2 index dikhayega

    name  marks     city
0  harry     92   rampur
1  rohan     34  kolkata

In [9]:
df.head (3)
# ye suru ka 3 index dikhayega

     name  marks      city
0   harry     92    rampur
1   rohan     34   kolkata
2  skillf     24  bareilly

In [10]:
df.tail (2)
# ye last ka 2 index dikhayega

     name  marks       city
2  skillf     24   bareilly
3   shubh     17  antartica

In [11]:
df.tail (3)
# ye last ka 3 index dikhayega

     name  marks       city
1   rohan     34    kolkata
2  skillf     24   bareilly
3   shubh     17  antartica

In [12]:
df.describe ()
# jo bhi numerical column data hain uska count, mean.std (standard deviation),min,25%,50%,75% and max value btayga

          marks
count   4.00000
mean   41.75000
std    34.21866
min    17.00000
25%    22.25000
50%    29.00000
75%    48.50000
max    92.00000

In [13]:
# Read a csv file and store it in a variable
harry = pd.read_csv('vikram.csv')

In [14]:
harry

,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,Train no,Speed,City
0,0,0,0,0,12233,100,Delhi
1,1,1,1,1,12351,57,Kolkata
2,2,2,2,2,12561,87,mumbai
3,3,3,3,3,24376,45,patna
4,4,4,4,4,23425,90,asansol

In [15]:
harry['City']

0      Delhi
1    Kolkata
2     mumbai
3      patna
4    asansol
Name: City, dtype: object

In [16]:
harry['Train no']

0    12233
1    12351
2    12561
3    24376
4    23425
Name: Train no, dtype: int64

In [17]:
harry['Speed ']
# there is a space gap after Speed

0    100
1     57
2     87
3     45
4     90
Name: Speed , dtype: int64

In [18]:
harry [['Train no', 'Speed ']]
# selecting more than one column at once

   Train no  Speed
0     12233     100
1     12351      57
2     12561      87
3     24376      45
4     23425      90

In [19]:
harry['Speed '].head(2)

0    100
1     57
Name: Speed , dtype: int64

In [20]:
harry['Speed '][0]
# shows the value of speed is 67

np.int64(100)

In [21]:
harry['Speed '][0] = 100
# we update the value of speed to 100
# this method is not advisable

C:\Users\Vikra\AppData\Local\Temp\ipykernel_21416\3119987439.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  harry['Speed '][0] = 100

In [22]:
harry['Speed ']

0    100
1     57
2     87
3     45
4     90
Name: Speed , dtype: int64

In [23]:
harry.to_csv ('vikram.csv')
# we are updating changes to csv file

In [24]:
# how to change index of csv file
harry.index = ['first','second','third','fourth','fifth']

In [25]:
harry

,Unnamed: 0.3,Unnamed: 0.2,Unnamed: 0.1,Unnamed: 0,Train no,Speed,City
first,0,0,0,0,12233,100,Delhi
second,1,1,1,1,12351,57,Kolkata
third,2,2,2,2,12561,87,mumbai
fourth,3,3,3,3,24376,45,patna
fifth,4,4,4,4,23425,90,asansol

In [26]:
# ----------------------------------------------------------------------------------------------------------------------------

In [27]:
# Pandas has two types of data structures:
# a) Series — It's a one dimensional array with indexes, it stores a single column or row of data in a Dataframe
# b) Dataframe — It's a tabular spreadsheet like structure representing rows each of which contains one or multiple columns
# A one-dimensional array(labeled) capable of holding any type of data— Series
# A two-dimensional data (labeled) structure with columns of potentially different types of data - DataFrame

In [28]:
ser = pd.Series (np.random.rand())

ser

In [29]:
type(ser)

pandas.core.series.Series

In [30]:
ser = pd.Series (np.random.rand(34))

In [31]:
ser

0     0.384705
1     0.267362
2     0.786535
3     0.923130
4     0.305147
5     0.106999
6     0.495095
7     0.028246
8     0.911554
9     0.294360
10    0.345899
11    0.769554
12    0.783256
13    0.148557
14    0.733598
15    0.223130
16    0.585964
17    0.078895
18    0.183891
19    0.280268
20    0.424596
21    0.260731
22    0.832399
23    0.192756
24    0.518528
25    0.268880
26    0.291873
27    0.576566
28    0.666024
29    0.258715
30    0.951802
31    0.360246
32    0.764735
33    0.655574
dtype: float64

In [32]:
# Now, we are going to make new DataFrame

In [33]:
newdf = pd.DataFrame(np.random.rand(334,5))

In [34]:
newdf

            0         1         2         3         4
0    0.611009  0.611746  0.149822  0.067704  0.050601
1    0.656886  0.207548  0.537298  0.306350  0.948215
2    0.196288  0.218291  0.485800  0.185677  0.547695
3    0.241423  0.279108  0.611594  0.847448  0.211211
4    0.750875  0.867997  0.545951  0.463476  0.236218
..        ...       ...       ...       ...       ...
329  0.904953  0.578238  0.702820  0.466348  0.762649
330  0.030365  0.744128  0.419243  0.786748  0.133599
331  0.917148  0.385769  0.019023  0.408803  0.453890
332  0.124627  0.050977  0.121169  0.661133  0.220999
333  0.984813  0.007421  0.716127  0.271203  0.266507

[334 rows x 5 columns]

In [35]:
newdf = pd.DataFrame(np.random.rand(334,5), index = np.arange(334))

In [36]:
newdf

            0         1         2         3         4
0    0.702837  0.796802  0.605197  0.677689  0.946136
1    0.639876  0.996306  0.866291  0.314346  0.536854
2    0.217725  0.652576  0.200264  0.370755  0.799253
3    0.123769  0.481043  0.813840  0.993323  0.411522
4    0.349830  0.709760  0.274271  0.869494  0.800147
..        ...       ...       ...       ...       ...
329  0.107950  0.498239  0.221168  0.541400  0.042265
330  0.822565  0.907572  0.978802  0.822662  0.748919
331  0.570113  0.768458  0.028898  0.891528  0.348228
332  0.028542  0.382930  0.444798  0.549669  0.726609
333  0.528709  0.836124  0.692449  0.281179  0.380991

[334 rows x 5 columns]

In [37]:
type(newdf)

pandas.core.frame.DataFrame

In [38]:
newdf.describe()

                0           1           2           3           4
count  334.000000  334.000000  334.000000  334.000000  334.000000
mean     0.467290    0.503096    0.482836    0.502106    0.507928
std      0.300590    0.291369    0.288470    0.288365    0.280038
min      0.002898    0.002198    0.004529    0.000732    0.004017
25%      0.191886    0.245918    0.231664    0.271270    0.280230
50%      0.456572    0.519956    0.444965    0.498639    0.503799
75%      0.742916    0.745230    0.725441    0.747959    0.748312
max      0.994914    0.996306    0.997426    0.996974    0.999253

In [39]:
newdf.dtypes
# ye har ek column ka data type bta raha hain

0    float64
1    float64
2    float64
3    float64
4    float64
dtype: object

In [40]:
newdf.head()

          0         1         2         3         4
0  0.702837  0.796802  0.605197  0.677689  0.946136
1  0.639876  0.996306  0.866291  0.314346  0.536854
2  0.217725  0.652576  0.200264  0.370755  0.799253
3  0.123769  0.481043  0.813840  0.993323  0.411522
4  0.349830  0.709760  0.274271  0.869494  0.800147

In [41]:
newdf[0][0] = "Vikram"

C:\Users\Vikra\AppData\Local\Temp\ipykernel_21416\771384931.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf[0][0] = "Vikram"
C:\Users\Vikra\AppData\Local\Temp\ipykernel_21416\771384931.py:1: FutureWarning: Setting an item of incompatible dtype is deprecated and will raise an error in a future version of pandas. Value 'Vikram' has dtype incompatible with float64, please explicitly cast to a compatible dtype first.
  newdf[0][0] = "Vikram"

In [42]:
newdf.head()

          0         1         2         3         4
0    Vikram  0.796802  0.605197  0.677689  0.946136
1  0.639876  0.996306  0.866291  0.314346  0.536854
2  0.217725  0.652576  0.200264  0.370755  0.799253
3  0.123769  0.481043  0.813840  0.993323  0.411522
4   0.34983  0.709760  0.274271  0.869494  0.800147

In [43]:
newdf.dtypes
# now column 0 has become object because we have put string in column 0

0     object
1    float64
2    float64
3    float64
4    float64
dtype: object

In [44]:
# now, we will print the index
newdf.index

Index([  0,   1,   2,   3,   4,   5,   6,   7,   8,   9,
       ...
       324, 325, 326, 327, 328, 329, 330, 331, 332, 333],
      dtype='int64', length=334)

In [45]:
# now, we will print the column of dataframe
newdf.columns

RangeIndex(start=0, stop=5, step=1)

In [46]:
newdf[0][0] = 0.34

In [47]:
newdf.head()

          0         1         2         3         4
0      0.34  0.796802  0.605197  0.677689  0.946136
1  0.639876  0.996306  0.866291  0.314346  0.536854
2  0.217725  0.652576  0.200264  0.370755  0.799253
3  0.123769  0.481043  0.813840  0.993323  0.411522
4   0.34983  0.709760  0.274271  0.869494  0.800147

In [48]:
# now, we will try to convert into numpy array
newdf.to_numpy()

array([[0.34, 0.7968017195363788, 0.6051966879373106, 0.6776888800746736,
        0.9461361207015906],
       [0.6398761275688942, 0.9963062013137056, 0.8662912684756181,
        0.31434646633023267, 0.5368536198243749],
       [0.2177251725018886, 0.6525764246961304, 0.20026428441287658,
        0.3707547685089003, 0.7992532149641066],
       ...,
       [0.5701125166723016, 0.7684577820199568, 0.028898273047750944,
        0.8915276607913912, 0.3482284260034144],
       [0.028541884621800184, 0.3829301921400735, 0.44479822014773884,
        0.5496687961595047, 0.7266092241588976],
       [0.5287086178970266, 0.8361236591239339, 0.6924488255534968,
        0.28117854121220753, 0.3809906953871174]], dtype=object)

In [49]:
newdf.T
# isse is data ka transpose ho jayga
# same as matrix transpose

,0,1,2,3,4,5,6,7,8,9,...,324,325,326,327,328,329,330,331,332,333
0,0.34,0.639876,0.217725,0.123769,0.34983,0.980856,0.290168,0.072228,0.59551,0.750252,...,0.397171,0.750959,0.818312,0.12803,0.400027,0.10795,0.822565,0.570113,0.028542,0.528709
1,0.796802,0.996306,0.652576,0.481043,0.70976,0.950423,0.37844,0.964096,0.815124,0.725654,...,0.847403,0.297044,0.924062,0.828768,0.86978,0.498239,0.907572,0.768458,0.38293,0.836124
2,0.605197,0.866291,0.200264,0.81384,0.274271,0.920564,0.425669,0.890619,0.679741,0.111386,...,0.3188,0.563013,0.706378,0.801229,0.835314,0.221168,0.978802,0.028898,0.444798,0.692449
3,0.677689,0.314346,0.370755,0.993323,0.869494,0.343514,0.984881,0.596778,0.326392,0.182851,...,0.843105,0.261903,0.447029,0.355739,0.733964,0.5414,0.822662,0.891528,0.549669,0.281179
4,0.946136,0.536854,0.799253,0.411522,0.800147,0.889517,0.720193,0.737103,0.270257,0.274065,...,0.432089,0.865414,0.310796,0.096033,0.276614,0.042265,0.748919,0.348228,0.726609,0.380991

In [50]:
# we will sort the index of data in descending order
newdf.sort_index (axis=0, ascending = False)
# by default ascending humesha True rehta hain
# axis yahan pe row ko represent karta hain

            0         1         2         3         4
333  0.528709  0.836124  0.692449  0.281179  0.380991
332  0.028542  0.382930  0.444798  0.549669  0.726609
331  0.570113  0.768458  0.028898  0.891528  0.348228
330  0.822565  0.907572  0.978802  0.822662  0.748919
329   0.10795  0.498239  0.221168  0.541400  0.042265
..        ...       ...       ...       ...       ...
4     0.34983  0.709760  0.274271  0.869494  0.800147
3    0.123769  0.481043  0.813840  0.993323  0.411522
2    0.217725  0.652576  0.200264  0.370755  0.799253
1    0.639876  0.996306  0.866291  0.314346  0.536854
0        0.34  0.796802  0.605197  0.677689  0.946136

[334 rows x 5 columns]

In [51]:
# NOTE: in 2-D numpy array
# axis = 0  [this represents row]
# axis = 1 [this represents column]

In [52]:
newdf.sort_index (axis=1, ascending = False)
# we have sorted the column in descending order

            4         3         2         1         0
0    0.946136  0.677689  0.605197  0.796802      0.34
1    0.536854  0.314346  0.866291  0.996306  0.639876
2    0.799253  0.370755  0.200264  0.652576  0.217725
3    0.411522  0.993323  0.813840  0.481043  0.123769
4    0.800147  0.869494  0.274271  0.709760   0.34983
..        ...       ...       ...       ...       ...
329  0.042265  0.541400  0.221168  0.498239   0.10795
330  0.748919  0.822662  0.978802  0.907572  0.822565
331  0.348228  0.891528  0.028898  0.768458  0.570113
332  0.726609  0.549669  0.444798  0.382930  0.028542
333  0.380991  0.281179  0.692449  0.836124  0.528709

[334 rows x 5 columns]

In [53]:
newdf.head()

          0         1         2         3         4
0      0.34  0.796802  0.605197  0.677689  0.946136
1  0.639876  0.996306  0.866291  0.314346  0.536854
2  0.217725  0.652576  0.200264  0.370755  0.799253
3  0.123769  0.481043  0.813840  0.993323  0.411522
4   0.34983  0.709760  0.274271  0.869494  0.800147

In [54]:
newdf[0]

0          0.34
1      0.639876
2      0.217725
3      0.123769
4       0.34983
         ...
329     0.10795
330    0.822565
331    0.570113
332    0.028542
333    0.528709
Name: 0, Length: 334, dtype: object

In [55]:
type (newdf[0])
# from here we can conclude that series ke combination se data frame banta hain

pandas.core.series.Series

In [56]:
newdf

            0         1         2         3         4
0        0.34  0.796802  0.605197  0.677689  0.946136
1    0.639876  0.996306  0.866291  0.314346  0.536854
2    0.217725  0.652576  0.200264  0.370755  0.799253
3    0.123769  0.481043  0.813840  0.993323  0.411522
4     0.34983  0.709760  0.274271  0.869494  0.800147
..        ...       ...       ...       ...       ...
329   0.10795  0.498239  0.221168  0.541400  0.042265
330  0.822565  0.907572  0.978802  0.822662  0.748919
331  0.570113  0.768458  0.028898  0.891528  0.348228
332  0.028542  0.382930  0.444798  0.549669  0.726609
333  0.528709  0.836124  0.692449  0.281179  0.380991

[334 rows x 5 columns]

In [57]:
newdf2 = newdf
# newdf2, newdf ka ek view hain [mtlb memory location main to wahi par hain per ek tarah se usko point kar raha hain] .
# think of it like a pointer
# agar newdf2 main change karenge to newdf bhi change hoga

In [58]:
newdf2[0][0] = 9783
# agar newdf2 main change karenge to newdf bhi change hoga

In [59]:
newdf.head()
# we can say that newdf is also changed

          0         1         2         3         4
0      9783  0.796802  0.605197  0.677689  0.946136
1  0.639876  0.996306  0.866291  0.314346  0.536854
2  0.217725  0.652576  0.200264  0.370755  0.799253
3  0.123769  0.481043  0.813840  0.993323  0.411522
4   0.34983  0.709760  0.274271  0.869494  0.800147

In [61]:
newdf3 = newdf.copy()
# isse copy ban jayga data ka

In [62]:
newdf3[0][0] = 420

C:\Users\Vikra\AppData\Local\Temp\ipykernel_21416\1250679543.py:1: FutureWarning: ChainedAssignmentError: behaviour will change in pandas 3.0!
You are setting values through chained assignment. Currently this works in certain cases, but when using Copy-on-Write (which will become the default behaviour in pandas 3.0) this will never work to update the original DataFrame or Series, because the intermediate object on which we are setting values will behave as a copy.
A typical example is when you are setting values in a column of a DataFrame, like:

df["col"][row_indexer] = value

Use `df.loc[row_indexer, "col"] = values` instead, to perform the assignment in a single step and ensure this keeps updating the original `df`.

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

  newdf3[0][0] = 420
C:\Users\Vikra\AppData\Local\Temp\ipykernel_21416\1250679543.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  newdf3[0][0] = 420

In [63]:
newdf.head()

          0         1         2         3         4
0      9783  0.796802  0.605197  0.677689  0.946136
1  0.639876  0.996306  0.866291  0.314346  0.536854
2  0.217725  0.652576  0.200264  0.370755  0.799253
3  0.123769  0.481043  0.813840  0.993323  0.411522
4   0.34983  0.709760  0.274271  0.869494  0.800147

In [64]:
newdf3.head()
# from this we can say that copy has been created

          0         1         2         3         4
0       420  0.796802  0.605197  0.677689  0.946136
1  0.639876  0.996306  0.866291  0.314346  0.536854
2  0.217725  0.652576  0.200264  0.370755  0.799253
3  0.123769  0.481043  0.813840  0.993323  0.411522
4   0.34983  0.709760  0.274271  0.869494  0.800147

In [69]:
# correct method to change a value of the DataFrame
# for this we have to use (loc) function
newdf.loc[0,0] = 9835644630

In [73]:
newdf.head(2)
# this is how we update the value

            0         1         2         3         4
0  9835644630  0.796802  0.605197  0.677689  0.946136
1    0.639876  0.996306  0.866291  0.314346  0.536854

In [71]:
newdf2.head(2)

            0         1         2         3         4
0  9835644630  0.796802  0.605197  0.677689  0.946136
1    0.639876  0.996306  0.866291  0.314346  0.536854

In [72]:
newdf3.head(2)

          0         1         2         3         4
0       420  0.796802  0.605197  0.677689  0.946136
1  0.639876  0.996306  0.866291  0.314346  0.536854

In [74]:
# renaming columns name in data frame
newdf.columns = list ("ABCDE")

In [75]:
newdf.head()
# columns name have been changed

            A         B         C         D         E
0  9835644630  0.796802  0.605197  0.677689  0.946136
1    0.639876  0.996306  0.866291  0.314346  0.536854
2    0.217725  0.652576  0.200264  0.370755  0.799253
3    0.123769  0.481043  0.813840  0.993323  0.411522
4     0.34983  0.709760  0.274271  0.869494  0.800147

In [76]:
# after changing name of columns, now we will try to change data
newdf.loc [0,'B'] = 345

In [78]:
newdf.head(2)
# the value of data is changed

            A           B         C         D         E
0  9835644630  345.000000  0.605197  0.677689  0.946136
1    0.639876    0.996306  0.866291  0.314346  0.536854

In [80]:
# if we had done
newdf.loc [0,0] = 2357
# then it had created a entirely new column

In [81]:
newdf.head()

            A           B         C         D         E       0
0  9835644630  345.000000  0.605197  0.677689  0.946136  2357.0
1    0.639876    0.996306  0.866291  0.314346  0.536854     NaN
2    0.217725    0.652576  0.200264  0.370755  0.799253     NaN
3    0.123769    0.481043  0.813840  0.993323  0.411522     NaN
4     0.34983    0.709760  0.274271  0.869494  0.800147     NaN

In [89]:
# delete a row from dataframe
newdf.drop (0)
# it will delete row, named index "0" from the dataframe
# to make these changes permanent we need to store datafeame in a variable

            A         B         C         D         E   0
1    0.639876  0.996306  0.866291  0.314346  0.536854 NaN
2    0.217725  0.652576  0.200264  0.370755  0.799253 NaN
3    0.123769  0.481043  0.813840  0.993323  0.411522 NaN
4     0.34983  0.709760  0.274271  0.869494  0.800147 NaN
5    0.980856  0.950423  0.920564  0.343514  0.889517 NaN
..        ...       ...       ...       ...       ...  ..
329   0.10795  0.498239  0.221168  0.541400  0.042265 NaN
330  0.822565  0.907572  0.978802  0.822662  0.748919 NaN
331  0.570113  0.768458  0.028898  0.891528  0.348228 NaN
332  0.028542  0.382930  0.444798  0.549669  0.726609 NaN
333  0.528709  0.836124  0.692449  0.281179  0.380991 NaN

[333 rows x 6 columns]

In [90]:
# delete a column from dataframe
newdf.drop (0 , axis = 1)
# it will delete column named "0" from the dataframe
# to make these changes permanent we need to store datafeame in a variable

              A           B         C         D         E
0    9835644630  345.000000  0.605197  0.677689  0.946136
1      0.639876    0.996306  0.866291  0.314346  0.536854
2      0.217725    0.652576  0.200264  0.370755  0.799253
3      0.123769    0.481043  0.813840  0.993323  0.411522
4       0.34983    0.709760  0.274271  0.869494  0.800147
..          ...         ...       ...       ...       ...
329     0.10795    0.498239  0.221168  0.541400  0.042265
330    0.822565    0.907572  0.978802  0.822662  0.748919
331    0.570113    0.768458  0.028898  0.891528  0.348228
332    0.028542    0.382930  0.444798  0.549669  0.726609
333    0.528709    0.836124  0.692449  0.281179  0.380991

[334 rows x 5 columns]

In [91]:
# delete a row from dataframe
newdf.drop (0 , axis = 0)
# it will delete row named "0" from the dataframe
# here, axis = 0 means, it will delete from row
# axis = 1 means, it will delete from column
# to make these changes permanent we need to store datafeame in a variable

            A         B         C         D         E   0
1    0.639876  0.996306  0.866291  0.314346  0.536854 NaN
2    0.217725  0.652576  0.200264  0.370755  0.799253 NaN
3    0.123769  0.481043  0.813840  0.993323  0.411522 NaN
4     0.34983  0.709760  0.274271  0.869494  0.800147 NaN
5    0.980856  0.950423  0.920564  0.343514  0.889517 NaN
..        ...       ...       ...       ...       ...  ..
329   0.10795  0.498239  0.221168  0.541400  0.042265 NaN
330  0.822565  0.907572  0.978802  0.822662  0.748919 NaN
331  0.570113  0.768458  0.028898  0.891528  0.348228 NaN
332  0.028542  0.382930  0.444798  0.549669  0.726609 NaN
333  0.528709  0.836124  0.692449  0.281179  0.380991 NaN

[333 rows x 6 columns]

In [88]:
newdf.head()

            A           B         C         D         E       0
0  9835644630  345.000000  0.605197  0.677689  0.946136  2357.0
1    0.639876    0.996306  0.866291  0.314346  0.536854     NaN
2    0.217725    0.652576  0.200264  0.370755  0.799253     NaN
3    0.123769    0.481043  0.813840  0.993323  0.411522     NaN
4     0.34983    0.709760  0.274271  0.869494  0.800147     NaN

In [95]:
#  TO GET DESIRED ROW AND COLUMN IN DATA FRAME
newdf.loc [[1,2], ['C','D']]
# to make these changes permanent we need to store datafeame in a variable

          C         D
1  0.866291  0.314346
2  0.200264  0.370755

In [96]:
#  TO GET DESIRED ROW AND ALL COLUMN IN DATA FRAME
newdf.loc [[1,2], : ]
# to make these changes permanent we need to store datafeame in a variable

          A         B         C         D         E   0
1  0.639876  0.996306  0.866291  0.314346  0.536854 NaN
2  0.217725  0.652576  0.200264  0.370755  0.799253 NaN

In [97]:
#  TO GET DESIRED COLUMN AND ALL ROW IN DATA FRAME
newdf.loc [ : , ['B', 'C', 'D']]
# to make these changes permanent we need to store datafeame in a variable

              B         C         D
0    345.000000  0.605197  0.677689
1      0.996306  0.866291  0.314346
2      0.652576  0.200264  0.370755
3      0.481043  0.813840  0.993323
4      0.709760  0.274271  0.869494
..          ...       ...       ...
329    0.498239  0.221168  0.541400
330    0.907572  0.978802  0.822662
331    0.768458  0.028898  0.891528
332    0.382930  0.444798  0.549669
333    0.836124  0.692449  0.281179

[334 rows x 3 columns]

In [98]:
newdf.loc [(newdf['A'] < 0.3 )]
# it will only give the value of column A which is less than o.3

            A         B         C         D         E   0
2    0.217725  0.652576  0.200264  0.370755  0.799253 NaN
3    0.123769  0.481043  0.813840  0.993323  0.411522 NaN
6    0.290168  0.378440  0.425669  0.984881  0.720193 NaN
7    0.072228  0.964096  0.890619  0.596778  0.737103 NaN
16    0.18059  0.698546  0.411745  0.659371  0.962407 NaN
..        ...       ...       ...       ...       ...  ..
321  0.070012  0.992606  0.683062  0.959330  0.369464 NaN
323  0.052922  0.523912  0.263556  0.617902  0.482171 NaN
327   0.12803  0.828768  0.801229  0.355739  0.096033 NaN
329   0.10795  0.498239  0.221168  0.541400  0.042265 NaN
332  0.028542  0.382930  0.444798  0.549669  0.726609 NaN

[124 rows x 6 columns]

In [99]:
newdf.loc [(newdf['A'] < 0.3 ) & newdf['C'] > 0.1]
# it will only give the value of [column A which is less than o.3 & column C > 0.1 ]

            A         B         C         D         E   0
2    0.217725  0.652576  0.200264  0.370755  0.799253 NaN
3    0.123769  0.481043  0.813840  0.993323  0.411522 NaN
6    0.290168  0.378440  0.425669  0.984881  0.720193 NaN
7    0.072228  0.964096  0.890619  0.596778  0.737103 NaN
16    0.18059  0.698546  0.411745  0.659371  0.962407 NaN
..        ...       ...       ...       ...       ...  ..
321  0.070012  0.992606  0.683062  0.959330  0.369464 NaN
323  0.052922  0.523912  0.263556  0.617902  0.482171 NaN
327   0.12803  0.828768  0.801229  0.355739  0.096033 NaN
329   0.10795  0.498239  0.221168  0.541400  0.042265 NaN
332  0.028542  0.382930  0.444798  0.549669  0.726609 NaN

[124 rows x 6 columns]

In [100]:
newdf.head()

            A           B         C         D         E       0
0  9835644630  345.000000  0.605197  0.677689  0.946136  2357.0
1    0.639876    0.996306  0.866291  0.314346  0.536854     NaN
2    0.217725    0.652576  0.200264  0.370755  0.799253     NaN
3    0.123769    0.481043  0.813840  0.993323  0.411522     NaN
4     0.34983    0.709760  0.274271  0.869494  0.800147     NaN

In [102]:
newdf.iloc [0,4] 
# iloc ke help se hum log index se value print kra sakte hain
# iske liye hume column ka naam janne ka koi jarurat nhi hain, sirf index ke help se humlog print kra sakte hain
# We are using name of row and column then we need to use (loc function) other than that we only need to use (Iloc function)

np.float64(0.9461361207015906)

In [103]:
newdf.iloc [[0,1],[1,2]]
# iloc ke help se hum log index se value print kra sakte hain
# iske liye hume column ka naam janne ka koi jarurat nhi hain, sirf index ke help se humlog print kra sakte hain
# We are using name of row and column then we need to use (loc function) other than that we only need to use (Iloc function)

            B         C
0  345.000000  0.605197
1    0.996306  0.866291

In [104]:
newdf.iloc [[0,5],[1,3]]
# iloc ke help se hum log index se value print kra sakte hain
# iske liye hume column ka naam janne ka koi jarurat nhi hain, sirf index ke help se humlog print kra sakte hain
# We are using name of row and column then we need to use (loc function) other than that we only need to use (Iloc function)

            B         D
0  345.000000  0.677689
5    0.950423  0.343514

In [106]:
newdf.head(3)

            A           B         C         D         E       0
0  9835644630  345.000000  0.605197  0.677689  0.946136  2357.0
1    0.639876    0.996306  0.866291  0.314346  0.536854     NaN
2    0.217725    0.652576  0.200264  0.370755  0.799253     NaN

In [111]:
# How to drop a multiple rows
newdf.drop([1, 3])

              A           B         C         D         E       0
0    9835644630  345.000000  0.605197  0.677689  0.946136  2357.0
2      0.217725    0.652576  0.200264  0.370755  0.799253     NaN
4       0.34983    0.709760  0.274271  0.869494  0.800147     NaN
5      0.980856    0.950423  0.920564  0.343514  0.889517     NaN
6      0.290168    0.378440  0.425669  0.984881  0.720193     NaN
..          ...         ...       ...       ...       ...     ...
329     0.10795    0.498239  0.221168  0.541400  0.042265     NaN
330    0.822565    0.907572  0.978802  0.822662  0.748919     NaN
331    0.570113    0.768458  0.028898  0.891528  0.348228     NaN
332    0.028542    0.382930  0.444798  0.549669  0.726609     NaN
333    0.528709    0.836124  0.692449  0.281179  0.380991     NaN

[332 rows x 6 columns]

In [112]:
# How to drop a multiple columns
newdf.drop(['A', 'B'], axis = 1)

            C         D         E       0
0    0.605197  0.677689  0.946136  2357.0
1    0.866291  0.314346  0.536854     NaN
2    0.200264  0.370755  0.799253     NaN
3    0.813840  0.993323  0.411522     NaN
4    0.274271  0.869494  0.800147     NaN
..        ...       ...       ...     ...
329  0.221168  0.541400  0.042265     NaN
330  0.978802  0.822662  0.748919     NaN
331  0.028898  0.891528  0.348228     NaN
332  0.444798  0.549669  0.726609     NaN
333  0.692449  0.281179  0.380991     NaN

[334 rows x 4 columns]

In [113]:
newdf.head()

            A           B         C         D         E       0
0  9835644630  345.000000  0.605197  0.677689  0.946136  2357.0
1    0.639876    0.996306  0.866291  0.314346  0.536854     NaN
2    0.217725    0.652576  0.200264  0.370755  0.799253     NaN
3    0.123769    0.481043  0.813840  0.993323  0.411522     NaN
4     0.34983    0.709760  0.274271  0.869494  0.800147     NaN

In [115]:
# How to drop a multiple columns
newdf.drop([0], axis = 1, inplace=True)
# (inplace = True) likhne se original data frame main hi change kar dega

In [116]:
newdf.head()

            A           B         C         D         E
0  9835644630  345.000000  0.605197  0.677689  0.946136
1    0.639876    0.996306  0.866291  0.314346  0.536854
2    0.217725    0.652576  0.200264  0.370755  0.799253
3    0.123769    0.481043  0.813840  0.993323  0.411522
4     0.34983    0.709760  0.274271  0.869494  0.800147

In [117]:
# after deleting index, We want to reset the numbering of index. So, that the index is continious
newdf.reset_index()
# per isse ye ek index naam ka column bhi de deta hain

     index           A           B         C         D         E
0        0  9835644630  345.000000  0.605197  0.677689  0.946136
1        1    0.639876    0.996306  0.866291  0.314346  0.536854
2        2    0.217725    0.652576  0.200264  0.370755  0.799253
3        3    0.123769    0.481043  0.813840  0.993323  0.411522
4        4     0.34983    0.709760  0.274271  0.869494  0.800147
..     ...         ...         ...       ...       ...       ...
329    329     0.10795    0.498239  0.221168  0.541400  0.042265
330    330    0.822565    0.907572  0.978802  0.822662  0.748919
331    331    0.570113    0.768458  0.028898  0.891528  0.348228
332    332    0.028542    0.382930  0.444798  0.549669  0.726609
333    333    0.528709    0.836124  0.692449  0.281179  0.380991

[334 rows x 6 columns]

In [118]:
# if we don,t want index column then
newdf.reset_index(drop = True)

              A           B         C         D         E
0    9835644630  345.000000  0.605197  0.677689  0.946136
1      0.639876    0.996306  0.866291  0.314346  0.536854
2      0.217725    0.652576  0.200264  0.370755  0.799253
3      0.123769    0.481043  0.813840  0.993323  0.411522
4       0.34983    0.709760  0.274271  0.869494  0.800147
..          ...         ...       ...       ...       ...
329     0.10795    0.498239  0.221168  0.541400  0.042265
330    0.822565    0.907572  0.978802  0.822662  0.748919
331    0.570113    0.768458  0.028898  0.891528  0.348228
332    0.028542    0.382930  0.444798  0.549669  0.726609
333    0.528709    0.836124  0.692449  0.281179  0.380991

[334 rows x 5 columns]